{"groupWithinSettlement": ["Anyone who has passed some sort of test or challenge (a manhood/ womanhood ritual, for example). It might be that if the characters don't undertake this ritual they will have some difficulties due to lack of respect. In some cases the ritual might merely be expensive, or in some cases it might potentially be lethal.", "Members of a certain political faction.", "Members of each political faction have a certain identifying mode of dress.", "All unmarried people. Also, roll a 50% chance to see if it's a different mode for unmarried males and females.", "All People who are not members of one of the city's official guilds.", "All members of a particular religion. This might be a sign that the religion is despised, but could also be a city-wide token of pride for the dominant religion. Alternatively, it might be that each of several religions sports a different identifying mode of dress.", "Members of a particular social class. This might be a high class, or it might be a shunned class.", "All Males.", "All members of a particular profession (this would probably extend to visitors), such as wizards, fighters, and thieves. Go with the more interesting professions: this is just extraneous detail if it doesn't apply to at least one party member.", "All Females.", "All members of a particular race or species.", "All members of one particular guild. This is likely the most prestigious guild, or a guild whose members are despised.", "All visitors.", "All who are parents. Also, roll a 50% chance to see if it's a different mode for fathers and mothers.", "Each odd-numbered visitor, or some other random selection process that makes some party members wear the garment and others not be allowed to.", "All married people. Also, roll a 50% chance to see if it's a different mode for married males and females.", "All People. This includes both residents and visitors. Visitors would be given, or would have to acquire, the proper article of dress before being allowed to", "All Residents."], "prideOfTown": ["Hospitality to foreigners", "Good manners", "Obedience of slaves", "A local \"wonder of the world\" (a structure)", "A local strongman", "Skill of animal breeders", "Local tea", "Remarkable fatness or thinness of locals", "Quality of pottery or ceramics", "Skill of locals at trading and haggling", "Size or taste of the local vegetables", "Skill of local merchants", "Local meats", "Local temple(s)", "Flamboyance of local clothing", "Severity of laws", "Quality of local food or cooking", "Quality of teeth", "Local bread", "Woodcarving", "A local \"wonder of the world\" (animal or beast)", "A local \"wonder of the world\" (a collection, museum, or library)", "Cleanliness of the town", "Statues", "Remarkable height of citizens", "Local livestock", "A local \"wonder of the world\" (a statue)", "Quality of sailors (If city/town is a port)", "Wine", "A local recipe/dish (e.g. Silverport-style fried rat)", "Comfortable beds", "Cleanliness of the people", "Local political leaders or political system", "Taverns/beer", "Security of local prison", "Beauty of the women", "Size of local fair", "Textiles", "Quality of glassblowing products", "Elaborate or constant insults", "Odd physical feature such as overbite or large eyes", "Skill of local soldiers", "A local \"wonder of the world\" (plant or tree)", "Local music", "Metalwork", "Manners or skill of town watch", "Local entertainers (juggling, etc.)", "Local cats", "Skill at a game (chess, discus-throwing, ete)", "Masonry"], "modeOfDress": ["A box or other small container. This might be for documents, or it might simply have a random connotation for the people of this culture.", "Nose ring or earring(s)", "Bells, of any size ranging from jingling little bells up to a cowbell around the neck", "Feathers (probably but not necessarily from a particular type of flying creature)", "Overlong sleeves or no sleeves (e.g., a vest)", "Wooden shoes, high boots, sandals, or other specific item of footwear", "Tattoo or ritual scarring", "Pointed shoes (including boots or slippers)", "Facial marking (paint, henna, etc) of a particular color or pattern", "A particular item of clothing, also of a particular color", "Wide-brimmed hat, hat with no brim, or specific hood", "Item of silverware, such as a spoon of a specific type. It might be that such a person is only allowed to eat with this particular implement, or it might be symbolic of a past event.", "Badge, embroidered or sewn with the relevant identifications or symbolic markings", "Metal collar, bracelet, or other non-decorative piece of metal", "Flowers", "Specific type of relict from your family", "Gloves, tights, or codpiece", "Mask or veil", "Criminals of a particular type (e.g., the \"Scarlet Letter\" worn by adulterers in puritan New England).", "Ribbons (whether or not of a particular color)", "Pointed hat (50% chance to require 1d3+1 points)"], "unusualDomesticatedAnimal": ["Giant ostriches", "Hippopotamus (good for river travel, maybe hauling barges)", "Yaks", "Elephants (or mammoths)", "Aurochs", "Rhinoceros (or Pleistocene-era giant wooly rhinoceros)", "Dinosaurs (quadruped)", "Floating fungus (big levitating mushroom-caps you ride on, for instance)", "Giant serpents", "Giant rodent (or different types of rodents for different purposes)", "Giant peacocks (perfect for the local imperial city)", "Dinosaurs (biped)", "Giant dogs or cats (or wolves)", "Giant walking air-breathing fish (sharks, whales, etc)", "Mutated giant animal (such as cats, dogs or any of the giant\" possibilities listed on the table. As with horses, the mutation might be chitin armor, horns, etc).", "Giant lizards", "Massive insects (for flying) or beetles (for riding and pulling carts)", "Giant goats (mountain goats would be great for mountainous regions)", "Mutant horses (chitin armor, horns, massive size, etc).", "Giant turtles (when it absolutely, positively has to be there next week). Big palanquins or wagons could be mounted on one, though."]}